clc,clear, fid = fopen('data15_6.txt');
a = textscan(fid, '%s'); b = strjoin(a{:},'');  %连接符为空字符''
%a{1}
%ans = 2×1 cell 数组
%{'1110010011111110011110111111001111111110001101101'}
%{'111011011010111101110111101111110011011111100111' }
%b ='1110010011111110011110111111001111111110001101101111011011010111101110111101111110011011111100111'
for i=0:1
    for j=0:1
        s=[int2str(i),int2str(j)]; %构造子字符串‘ij’
        f(i+1,j+1)=length(strfind(b,s));  %计算子串‘ij’的个数
    end
end
fs=sym(sum(f,2));  %求f矩阵的行和,并转换为符号数
p=f./fs            %求状态转移频率



